china-djyos/djyos/bsp/cpudrv/stm32/f7/src/nand/cpu_peri_nand.c
                if(-1==end)
                    end = __nandescription->BlksPerLUN * __nandescription->LUNs;
                else if (start)
                    end += start;

                do
                {
                    if((badslocation==(--end))&&escape) // 坏块表在第一页
                        continue;

                    if(__nand_erase((s64)end, *sz))
                    {
                        res = -1;
                        break;
                    }
                }
                while(end!=start);
            }
            else
            {
                res = -1;
            }

            free(tmp);
            break;
        }

        default: res = -1; break;
    }

    return (res);
}

// ============================================================================
// 功能：nand 读；
// 参数：unit -- 读的序号（页）；
//      data -- 读的数据；
//      opt -- 读的方式；
// 备注：
// ============================================================================
static s32 __nand_read(s64 unit, void *data, struct uopt opt)
{
    u32 flags = 0;

    nandbadfreeunit(badstable, &unit, __nand_req);
    if(opt.hecc)
        flags |= HW_ECC;
    else if(opt.secc)
        flags |= SW_ECC;
    else
        flags |= NO_ECC;

    if(opt.main)
    {
        if(opt.spare)
            flags |= SPARE_REQ;

        return (stm32f7_PageRead((u32)unit, (u8*)data, flags));
    }
    else
    {
        return (stm32f7_SpareRead((u32)unit, (u8*)data));
    }

    return (0);
}

// ============================================================================
// 功能：nand 写；
// 参数：unit -- 写的序号（页）；
//      data -- 写的数据；
//      opt -- 写的方式；
// 返回：
// 备注：
// ============================================================================
static s32 __nand_write(s64 unit, void *data, struct uopt opt)
{
    u32 flags = 0;

    nandbadfreeunit(badstable, &unit, __nand_req);
    if(opt.hecc)
        flags |= HW_ECC;
    else if(opt.secc)
        flags |= SW_ECC;
    else
        flags |= NO_ECC;

    if(opt.main)
    {
        if(opt.spare)
            flags |= SPARE_REQ;

        return (stm32f7_PageProgram((u32)unit, (u8*)data, flags));
    }
    else
    {
        return (stm32f7_SpareProgram((u32)unit, (u8*)data));
    }

    return (0);
}

// ============================================================================
// 功能：nand 擦除
// 参数：unit -- 擦除的序号；
//      sz -- 擦除的单位（unit或block）
// 返回：
// 备注：
// ============================================================================
static s32 __nand_erase(s64 unit, struct uesz sz)
{
    u32 block;

    if(sz.unit)
    {
        nandbadfreeunit(badstable, &unit, __nand_req);
        block = (u32)(unit / __nandescription->PagesPerBlk);
    }
    else
    {
        block = unit;
        nandbadfreeblock(badstable, &block, __nand_req);
    }

    return (stm32f7_BlockErase(block));
}

// ============================================================================
// 功能：
// 参数：
// 返回：
// 备注：
// ============================================================================
static s32 __nand_init(void)
{
    __nandescription = malloc(sizeof(*__nandescription));
    if(!__nandescription)
        return (-1);

    stm32f7_NAND_ControllerConfig();// 芯片管脚等基本配置
    if(stm32f7_GetNandDescr(__nandescription))
    {
        free(__nandescription);
        __nandescription = NULL;
        return (-1);
    }

    __nandescription->ReservedBlks = 0;
    __nandescription->Controller = HW_ECC_SUPPORTED;
    __nandescription->BadMarkOffset = __nandescription->OOB_Size - 4 - 1;
    return (0);
}

// ============================================================================
// 功能：
// 参数：
// 返回：
// 备注：
// ============================================================================
s32 __nand_part_init(u32 bstart, u32 bcount, u32 doformat)
{
    struct umedia *um;
    struct uopt opt;
    char name[16], part[3];
    static u8 count = 0;

    if(!__nandescription)
    {
        if(__nand_init())
        {
            printf("\r\n: erro : device : nand initialization failed(init).");
            return (-1);
        }
    }

    if(doformat)
    {
        struct uesz sz;
        sz.unit = 0;
        sz.block = 1;
        __nand_req(format, bstart , bcount, &sz);
    }

    if(!badstable)
    {
        badstable = nandbuildbads(__nand_req);
        if(!badstable)
        {
            printf("\r\n: erro : device : nand initialization failed(bad table).");
            return (-1);
        }
    }

    um = malloc(sizeof(struct umedia)+__nandescription->BytesPerPage+__nandescription->OOB_Size);
    if(!um)
        return (-1);

    opt.hecc = 0;
    opt.main = 1;
    opt.necc = 1;
    opt.secc = 0;
    opt.spare = 1;
    if(-1 == bcount)
    {
        bcount = __nandescription->BlksPerLUN * __nandescription->LUNs;
        bcount -= bstart;
        um->asz = __nandescription->BytesPerPage * __nandescription->PagesPerBlk * bcount;
    }
    else
    {
        um->asz = __nandescription->BytesPerPage * __nandescription->PagesPerBlk * bcount;
    }

    um->esz = log2(__nandescription->BytesPerPage * __nandescription->PagesPerBlk); //
    um->usz = log2(__nandescription->BytesPerPage);
    um->merase = __nand_erase;
    um->mread = __nand_read;
    um->mreq = __nand_req;
    um->mwrite = __nand_write;
    um->opt = opt;
    um->type = nand;
    um->ubuf = (u8*)um + sizeof(struct umedia);
    um->ustart = bstart*__nandescription->PagesPerBlk; // 起始unit号
    itoa(count++, part, 10);
    sprintf(name, "nand part %s", part);
    if(um_add((const char*)name, um))
    {
        printf("\r\n: erro : device : %s addition failed.", name);
        return (-1);
    }

    printf("\r\n: info : device : %s added(start:%d, blocks:%d).", name, bstart, bcount);
    return (0);
}

#endif
